scripts/load/artillery.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:5173' }}"
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 60
      arrivalRate: 5
      rampTo: 12
    - duration: 30
      arrivalRate: 3
  defaults:
    headers:
      accept: text/html
scenarios:
  - name: Public mission-control sweep
    flow:
      - get:
          url: '/auth'
      - think: 1
      - get:
          url: '/'
      - get:
          url: '/command-center'
      - think: 1
      - get:
          url: '/robots.txt'